Revit 2027 API
RoofComponents.GetPlaneOrigins Method
 The plane origins of roof slabs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetPlaneOrigins()
Public Function GetPlaneOrigins As IList(Of XYZ)
public:
IList<XYZ^>^ GetPlaneOrigins()
member GetPlaneOrigins : unit -> IList<XYZ>
Return Value
IList<XYZ>
 The origins.
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace